test_examples/tube_OpenFoam3d_abaqus3d/Test_Writing_pointDisplacementFromSourceCode_Implicit_Explicit/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            uniformTotalPressure;
        p0           	table
	(
	(0 1333.2)
	(0.003 1333.2)
	);
    }

    outlet
    {
        type            fixedValue;
	value		uniform 0;

    }

    mantle
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
