test_examples/tube_OpenFoam3d_abaqus3d/Test_Writing_pointDisplacementFromSourceCode_Implicit_Explicit/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	 ".*"
	 {
		 type            fixedValue;
	 	 value           uniform (0 0 0);
	 }


mantle
{
type fixedValue;
value  nonuniform List<vector>
1568
(
(0.0 -0.0004755282581475768 0.0)
(0.0 -0.0004916274538201447 0.0)
(0.0 -0.00048218097014849216 9.722613020517724e-05)
(0.0 -0.0004663911160065201 9.74232549592415e-05)
(0.0 -0.0004542045422053886 0.00019071591474658538)
(0.0 -0.00043933082483359843 0.00019110258886095386)
(0.0 -0.00040877328844436315 0.00027687659361350634)
(0.0 -0.0003953872964594803 0.0002774379574187615)
...
);
}
